ArangoDB_SpringBoot_Project/pizzaDelivery/src/test/Artillary/artillerytest_arango_60_20.txt
Started phase 0 (Warm up), duration: 60s @ 12:16:40(+0530) 2020-12-14
Report @ 12:16:50(+0530) 2020-12-14
Elapsed time: 10 seconds
  Scenarios launched:  199
  Scenarios completed: 199
  Requests completed:  199
  Mean response/sec: 20.08
  Response time (msec):
    min: 1.8
    max: 5.6
    median: 2
    p95: 3
    p99: 4.5
  Codes:
    200: 199

Report @ 12:17:00(+0530) 2020-12-14
Elapsed time: 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 1.8
    max: 14.4
    median: 2
    p95: 2.8
    p99: 3.7
  Codes:
    200: 200

Report @ 12:17:10(+0530) 2020-12-14
Elapsed time: 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 1.6
    max: 18.3
    median: 1.9
    p95: 3.2
    p99: 3.7
  Codes:
    200: 200

Report @ 12:17:20(+0530) 2020-12-14
Elapsed time: 40 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 1.7
    max: 5.5
    median: 1.9
    p95: 3
    p99: 3.7
  Codes:
    200: 200

Report @ 12:17:30(+0530) 2020-12-14
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 1.5
    max: 3.7
    median: 1.9
    p95: 2.7
    p99: 3.4
  Codes:
    200: 200

Report @ 12:17:40(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 1.6
    max: 14.2
    median: 1.9
    p95: 3
    p99: 3.9
  Codes:
    200: 200

Report @ 12:17:41(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 1.7
    max: 1.7
    median: 1.7
    p95: 1.7
    p99: 1.7
  Codes:
    200: 1

All virtual users finished
Summary report @ 12:17:41(+0530) 2020-12-14
  Scenarios launched:  1200
  Scenarios completed: 1200
  Requests completed:  1200
  Mean response/sec: 19.86
  Response time (msec):
    min: 1.5
    max: 18.3
    median: 1.9
    p95: 3
    p99: 3.7
  Scenario counts:
    Search and buy: 1200 (100%)
  Codes:
    200: 1200