ArangoDB_SpringBoot_Project/pizzaDelivery/src/test/Artillary/artillerytest_arango_60_30.txt
Started phase 0 (Ramp up), duration: 60s @ 12:22:27(+0530) 2020-12-14
Report @ 12:22:37(+0530) 2020-12-14
Elapsed time: 10 seconds
  Scenarios launched:  299
  Scenarios completed: 299
  Requests completed:  299
  Mean response/sec: 30.11
  Response time (msec):
    min: 1.5
    max: 20.5
    median: 1.9
    p95: 2.1
    p99: 4.5
  Codes:
    200: 299

Warning: 
CPU usage of Artillery seems to be very high (pids: 40984)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 12:22:47(+0530) 2020-12-14
Elapsed time: 20 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30.03
  Response time (msec):
    min: 1.6
    max: 23.3
    median: 1.8
    p95: 1.9
    p99: 3
  Codes:
    200: 300

Report @ 12:22:57(+0530) 2020-12-14
Elapsed time: 30 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 1.6
    max: 3.5
    median: 1.8
    p95: 2
    p99: 3.3
  Codes:
    200: 300

Warning: High CPU usage warning (pids: 40984).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 12:23:07(+0530) 2020-12-14
Elapsed time: 40 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 1.5
    max: 33.6
    median: 1.8
    p95: 2
    p99: 3.1
  Codes:
    200: 300

Warning: High CPU usage warning (pids: 40984).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 12:23:17(+0530) 2020-12-14
Elapsed time: 50 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 1.5
    max: 7
    median: 1.8
    p95: 2.1
    p99: 3.1
  Codes:
    200: 300

Report @ 12:23:27(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  300
  Scenarios completed: 300
  Requests completed:  300
  Mean response/sec: 30
  Response time (msec):
    min: 1.5
    max: 4
    median: 1.8
    p95: 1.9
    p99: 3.3
  Codes:
    200: 300

Report @ 12:23:28(+0530) 2020-12-14
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 1.9
    max: 1.9
    median: 1.9
    p95: 1.9
    p99: 1.9
  Codes:
    200: 1

All virtual users finished
Summary report @ 12:23:28(+0530) 2020-12-14
  Scenarios launched:  1800
  Scenarios completed: 1800
  Requests completed:  1800
  Mean response/sec: 29.78
  Response time (msec):
    min: 1.5
    max: 33.6
    median: 1.8
    p95: 2
    p99: 3.2
  Scenario counts:
    Search and buy: 1800 (100%)
  Codes:
    200: 1800