ArangoDB_SpringBoot_Project/pizzaDelivery/src/test/Artillary/artillerytest_pizzaOMS.txt
Started phase 0 (Warm up), duration: 60s @ 17:57:36(+0530) 2020-12-13
Report @ 17:57:46(+0530) 2020-12-13
Elapsed time: 10 seconds
  Scenarios launched:  199
  Scenarios completed: 199
  Requests completed:  199
  Mean response/sec: 20.08
  Response time (msec):
    min: 2
    max: 25.2
    median: 2.5
    p95: 5.9
    p99: 11.5
  Codes:
    200: 199

Report @ 17:57:56(+0530) 2020-12-13
Elapsed time: 20 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 1.9
    max: 27.7
    median: 2.2
    p95: 3.8
    p99: 4.4
  Codes:
    200: 200

Report @ 17:58:06(+0530) 2020-12-13
Elapsed time: 30 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 1.8
    max: 20.8
    median: 2.2
    p95: 3.8
    p99: 5.5
  Codes:
    200: 200

Report @ 17:58:16(+0530) 2020-12-13
Elapsed time: 40 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 1.7
    max: 5.7
    median: 2
    p95: 3.3
    p99: 4.6
  Codes:
    200: 200

Report @ 17:58:26(+0530) 2020-12-13
Elapsed time: 50 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20
  Response time (msec):
    min: 1.7
    max: 5.1
    median: 2.1
    p95: 3.6
    p99: 4.3
  Codes:
    200: 200

Report @ 17:58:36(+0530) 2020-12-13
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  200
  Scenarios completed: 200
  Requests completed:  200
  Mean response/sec: 20.02
  Response time (msec):
    min: 1.6
    max: 15.3
    median: 1.9
    p95: 3.2
    p99: 3.8
  Codes:
    200: 200

Report @ 17:58:36(+0530) 2020-12-13
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  1
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: 2
  Response time (msec):
    min: 1.8
    max: 1.8
    median: 1.8
    p95: 1.8
    p99: 1.8
  Codes:
    200: 1

All virtual users finished
Summary report @ 17:58:36(+0530) 2020-12-13
  Scenarios launched:  1200
  Scenarios completed: 1200
  Requests completed:  1200
  Mean response/sec: 19.86
  Response time (msec):
    min: 1.6
    max: 27.7
    median: 2.2
    p95: 3.8
    p99: 6
  Scenario counts:
    Search and buy: 1200 (100%)
  Codes:
    200: 1200